## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value"  {
      ~ id      = "3439163708" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_secret_access_key_9tv4ch-71ncKV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (23 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition"  {
      ~ id       = "e153be5f5e7cccd6ad9a0faadb4d9e20a464661132e45a525b5461b9664e3238" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.20"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - environment      = [
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "S3_UPLOADS_BUCKET_URL"
                          - value = "https://articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                      - {
                          - name  = "C3_DISTRIBUTION_ID"
                          - value = "E355EOO70XE75H"
                        },
                    ]
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.25.2"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn"
                        },
                      - {
                          - name      = "C3_AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT"
                        },
                      - {
                          - name      = "C3_AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_secret_access_key_9tv4ch-71ncKV"
                        },
                      - {
                          - name      = "JWT_AUTH_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu"
                        },
                      - {
                          - name      = "WPML_SITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = <<-EOT
            [
              {
                 "name": "apache",
                 "image": "${APACHE_IMAGE}",
                 "essential": true,
                 "logConfiguration": {
                    "logDriver": "awslogs",
                    "options": {
                      "awslogs-group": "${AWS_LOGS_GROUP}",
                      "awslogs-region": "${AWS_LOGS_REGION}",
                      "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                    }
                  },
                 "portMappings": [
                   {
                     "hostPort": 443,
                     "containerPort": 443,
                     "protocol": "tcp"
                   }
                 ],
                 "volumesFrom": [
                    {
                      "sourceContainer": "wordpress",
                      "readOnly": true
                    }
                 ]
              },
              {
                "name" : "wordpress",
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "portMappings": [
                  {
                    "hostPort": 9000,
                    "containerPort": 9000,
                    "protocol": "tcp"
                  }
                ],
                "essential": true,
                "image": "${WORDPRESS_IMAGE}",
                "environment": [
                  {
                    "name": "DEFAULT_DOMAIN",
                    "value": "${DEFAULT_DOMAIN}"
                  },
                  {
                    "name": "S3_UPLOADS_BUCKET_URL",
                    "value": "${S3_UPLOADS_BUCKET_URL}"
                  },
                  {
                    "name": "WORDPRESS_CONFIG_EXTRA",
                    "value": "${WORDPRESS_CONFIG_EXTRA}"
                  },
                  {
                    "name": "C3_DISTRIBUTION_ID",
                    "value": "${C3_DISTRIBUTION_ID}"
                  }
                ],
                "secrets": [
                  {
                    "name": "LIST_MANAGER_ENDPOINT",
                    "valueFrom": "${LIST_MANAGER_ENDPOINT}"
                  },
                  {
                    "name": "DEFAULT_LIST_MANAGER_API_KEY",
                    "valueFrom": "${DEFAULT_LIST_MANAGER_API_KEY}"
                  },
                  {
                    "name": "DEFAULT_NOTIFY_API_KEY",
                    "valueFrom": "${DEFAULT_NOTIFY_API_KEY}"
                  },
                  {
                    "name": "ENCRYPTION_KEY",
                    "valueFrom": "${ENCRYPTION_KEY}"
                  },
                  {
                    "name": "S3_UPLOADS_BUCKET",
                    "valueFrom": "${S3_UPLOADS_BUCKET}"
                  },
                  {
                    "name": "S3_UPLOADS_KEY",
                    "valueFrom": "${S3_UPLOADS_KEY}"
                  },
                  {
                    "name": "S3_UPLOADS_SECRET",
                    "valueFrom": "${S3_UPLOADS_SECRET}"
                  },
                  {
                    "name": "C3_AWS_ACCESS_KEY_ID",
                    "valueFrom": "${C3_AWS_ACCESS_KEY_ID}"
                  },
                  {
                    "name": "C3_AWS_SECRET_ACCESS_KEY",
                    "valueFrom": "${C3_AWS_SECRET_ACCESS_KEY}"
                  },
                  {
                    "name": "JWT_AUTH_SECRET_KEY",
                    "valueFrom": "${JWT_AUTH_SECRET_KEY}"
                  },
                  {
                    "name": "WPML_SITE_KEY",
                    "valueFrom": "${WPML_SITE_KEY}"
                  },
                  {
                    "name": "WORDPRESS_DB_HOST",
                    "valueFrom": "${WORDPRESS_DB_HOST}"
                  },
                  {
                    "name": "WORDPRESS_DB_USER",
                    "valueFrom": "${WORDPRESS_DB_USER}"
                  },
                  {
                    "name": "WORDPRESS_DB_PASSWORD",
                    "valueFrom": "${WORDPRESS_DB_PASSWORD}"
                  },
                  {
                    "name": "WORDPRESS_DB_NAME",
                    "valueFrom": "${WORDPRESS_DB_NAME}"
                  },
                  {
                    "name": "WORDPRESS_AUTH_KEY",
                    "valueFrom": "${WORDPRESS_AUTH_KEY}"
                  },
                  {
                    "name": "WORDPRESS_SECURE_AUTH_KEY",
                    "valueFrom": "${WORDPRESS_SECURE_AUTH_KEY}"
                  },
                  {
                    "name": "WORDPRESS_LOGGED_IN_KEY",
                    "valueFrom": "${WORDPRESS_LOGGED_IN_KEY}"
                  },
                  {
                    "name": "WORDPRESS_NONCE_KEY",
                    "valueFrom": "${WORDPRESS_NONCE_KEY}"
                  },
                  {
                    "name": "WORDPRESS_AUTH_SALT",
                    "valueFrom": "${WORDPRESS_AUTH_SALT}"
                  },
                  {
                    "name": "WORDPRESS_SECURE_AUTH_SALT",
                    "valueFrom": "${WORDPRESS_SECURE_AUTH_SALT}"
                  },
                  {
                    "name": "WORDPRESS_LOGGED_IN_SALT",
                    "valueFrom": "${WORDPRESS_LOGGED_IN_SALT}"
                  },
                  {
                    "name": "WORDPRESS_NONCE_SALT",
                    "valueFrom": "${WORDPRESS_NONCE_SALT}"
          +       },
          +       {
          +         "name": "ZENDESK_API_URL",
          +         "valueFrom": ${ZENDESK_API_URL}
                  }
                ]
              }
            ]
        EOT
      ~ vars     = {
          + "ZENDESK_API_URL"              = (known after apply)
            # (33 unchanged elements hidden)
        }
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:101" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:101" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.20"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "C3_DISTRIBUTION_ID"
                          - value = "E355EOO70XE75H"
                        },
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "S3_UPLOADS_BUCKET_URL"
                          - value = "https://articles.cdssandbox.xyz"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.25.2"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn"
                        },
                      - {
                          - name      = "C3_AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT"
                        },
                      - {
                          - name      = "C3_AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_secret_access_key_9tv4ch-71ncKV"
                        },
                      - {
                          - name      = "JWT_AUTH_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu"
                        },
                      - {
                          - name      = "WPML_SITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 101 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::729164266357:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:jwt_auth_secret_key_9tv4ch-lkujAu",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_secret_access_key_9tv4ch-71ncKV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:c3_aws_access_key_id_9tv4ch-qXXOAT",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.zendesk_api_url will be created
  + resource "aws_secretsmanager_secret" "zendesk_api_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "zendesk_api_url_9tv4ch"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.zendesk_api_url will be created
  + resource "aws_secretsmanager_secret_version" "zendesk_api_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>